In [275]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt
from word2number import w2n

## Önce Verimizi Önişlemeden Geçirip Modellemeye Hazır Hale Getiriyoruz.

In [276]:
data = pd.read_csv("hiring.csv")

In [277]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [278]:
data.columns = ("exp","test_score","int_score","salary")

In [279]:
data

      exp  test_score  int_score  salary
0     NaN         8.0          9   50000
1     NaN         8.0          6   45000
2    five         6.0          7   60000
3     two        10.0         10   65000
4   seven         9.0          6   70000
5   three         7.0         10   62000
6     ten         NaN          7   72000
7  eleven         7.0          8   80000

In [280]:
tmp = data["test_score"].dropna() ##na olmayan test skorlarının medianını buldum.

In [281]:
tmp.median() ## scoreda boş değer var oraya median ı koyacağım mantıklı bir sonuç alabilmek için.

8.0

In [282]:
data["test_score"] = data["test_score"].fillna(8)

In [283]:
data

      exp  test_score  int_score  salary
0     NaN         8.0          9   50000
1     NaN         8.0          6   45000
2    five         6.0          7   60000
3     two        10.0         10   65000
4   seven         9.0          6   70000
5   three         7.0         10   62000
6     ten         8.0          7   72000
7  eleven         7.0          8   80000

In [284]:
data.exp[2:] = data.exp[2:].apply(w2n.word_to_num)

C:\Users\FURKAN~1\AppData\Local\Temp/ipykernel_1116/3340146840.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.exp[2:] = data.exp[2:].apply(w2n.word_to_num)

In [286]:
data["exp"][2:].median()

6.0

In [288]:
data["exp"] = data["exp"].fillna(6)

In [289]:
data

   exp  test_score  int_score  salary
0    6         8.0          9   50000
1    6         8.0          6   45000
2    5         6.0          7   60000
3    2        10.0         10   65000
4    7         9.0          6   70000
5    3         7.0         10   62000
6   10         8.0          7   72000
7   11         7.0          8   80000

In [290]:
test_x = data.drop("salary",axis="columns")

In [291]:
test_x

   exp  test_score  int_score
0    6         8.0          9
1    6         8.0          6
2    5         6.0          7
3    2        10.0         10
4    7         9.0          6
5    3         7.0         10
6   10         8.0          7
7   11         7.0          8

In [292]:
test_y = data.salary

In [293]:
reg.fit(test_x,test_y)

LinearRegression()

In [294]:
reg.predict([[2,9,6]])

array([47056.91056911])